## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
[command]/home/runner/work/_temp/03152abe-afd9-4b9b-a4c3-054dafce6e8f/terraform-bin show -no-color main.tfplan

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.resource-group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "australiaeast"
      + name     = "arg-ec-01"
      + tags     = {
          + "environment" = "dev"
        }
    }

  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = "australiaeast"
      + name                = "uai-dev-e01"
      + principal_id        = (known after apply)
      + resource_group_name = "arg-ec-01"
      + tags                = {
          + "environment" = "dev"
        }
      + tenant_id           = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + resource_group_name = "arg-ec-01"
::debug::Terraform exited with code 0.
::debug::stdout: %0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A%0ATerraform will perform the following actions:%0A%0A  # module.resource-group.azurerm_resource_group.rg will be created%0A  + resource "azurerm_resource_group" "rg" {%0A      + id       = (known after apply)%0A      + location = "australiaeast"%0A      + name     = "arg-ec-01"%0A      + tags     = {%0A          + "environment" = "dev"%0A        }%0A    }%0A%0A  # module.user_assigned_identity.azurerm_user_assigned_identity.msi will be created%0A  + resource "azurerm_user_assigned_identity" "msi" {%0A      + client_id           = (known after apply)%0A      + id                  = (known after apply)%0A      + location            = "australiaeast"%0A      + name                = "uai-dev-e01"%0A      + principal_id        = (known after apply)%0A      + resource_group_name = "arg-ec-01"%0A      + tags                = {%0A          + "environment" = "dev"%0A        }%0A      + tenant_id           = (known after apply)%0A    }%0A%0APlan: 2 to add, 0 to change, 0 to destroy.%0A%0AChanges to Outputs:%0A  + resource_group_name = "arg-ec-01"%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>